Tekla Open API Reference for Tekla Structures 2025
Reinforcement.RebarGeometrySimplificationTypeEnum Enumeration
 The rebar geometry simplification type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarGeometrySimplificationTypeEnum
Public Enumeration RebarGeometrySimplificationTypeEnum
Members
Member name | Value | Description
NONE | 0 |  No simplification.
RATIONALIZED | 1 |  Rationalized geometry - includes segmented arcs converted to true arcs by Rebar Shape Recognition.
FABRICATION | 2 |  Fabrication geometry - includes arcs recognized as straight by Rebar Shape Recognition.
See Also
Reference
Tekla.Structures.Model Namespace